{"identifier":{"url":"doc:\/\/Whiteboard\/documentation\/Whiteboard\/Concurrency","interfaceLanguage":"swift"},"kind":"article","hierarchy":{"paths":[["doc:\/\/Whiteboard\/documentation\/Whiteboard"]]},"abstract":[{"type":"text","text":"The "},{"type":"reference","identifier":"doc:\/\/Whiteboard\/documentation\/Whiteboard","isActive":true},{"type":"text","text":" offers high-performance, lock-free access to shared memory for an arbitrary number of concurrent readers and a single writer for each message type at any given time.  This provides the ability for a writer to broadcast state messages with pull semantics to a large number of readers."}],"sections":[],"metadata":{"title":"Concurrency","roleHeading":"Article","role":"article","modules":[{"name":"Whiteboard"}]},"primaryContentSections":[{"content":[{"type":"heading","text":"Sphere of Control","anchor":"Sphere-of-Control","level":2},{"type":"paragraph","inlineContent":[{"text":"A key concept behind the whiteboard architecture is the ability for readers and writers to determine the timing of ","type":"text"},{"code":"post(message:)","type":"codeVoice"},{"text":" and ","type":"text"},{"code":"getMessage()","type":"codeVoice"},{"text":" operations.  In other words, the timing of these operations remains in the sphere of control of the subsystem accessing the corresponding message, rather than creating a task synchronisation point.  This allows subsystems to remain de-coupled while providing fully concurrent message access.","type":"text"}]},{"type":"heading","text":"State Messages","anchor":"State-Messages","level":2},{"type":"paragraph","inlineContent":[{"text":"The semantics of the whiteboard is that of a shared memory structure.  This means that multiple reads from the same location will yield the same value until a new message has been posted to this location by a writer.  Conversely, only the latest value that was posted will be visible on the whiteboard.  Therefore, readers are only guaranteed to see every message that was posted if they read at least as frequently as the corresponding writer posts their messages.","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"In general, it is recommended that any message that gets posted is a state message, i.e., it conveys the full information (state) the writer wants to convey.  For example a value ","type":"text"},{"code":"currentTemperature","type":"codeVoice"},{"text":" that captures the latest temperature measurement constitutes a state message.  By contrast a value ","type":"text"},{"code":"temperatureChange","type":"codeVoice"},{"text":" that contains the difference between the previous and current measurements constitutes an event message capturing the difference between a previous and current state (temperature).  Event messages are not recommended, as they require knowledge of both the previous value (state) as well as the difference (change) to determine current value (state), which makes them more sensitive to message loss.","type":"text"}]}],"kind":"content"}],"schemaVersion":{"major":0,"patch":0,"minor":3},"variants":[{"paths":["\/documentation\/whiteboard\/concurrency"],"traits":[{"interfaceLanguage":"swift"}]}],"references":{"doc://Whiteboard/documentation/Whiteboard":{"abstract":[],"type":"topic","identifier":"doc:\/\/Whiteboard\/documentation\/Whiteboard","title":"Whiteboard","role":"collection","url":"\/documentation\/whiteboard","kind":"symbol"}}}